{
    "Can I use my existing mechanical drive or hydraulic pump?": "yes, any type of 12/24 volt reversing drives up to 30 amps are supported.  You can test the drive by applying power directly to it and ensure the rudder moves in both directions by switching the wires (polarity).  Some systems have separate (smaller) wires for a clutch output which may need power to engage the drive.",
    "What kind of mechanical drive do I need?": "pypilot typically drives a brushed dc motor that moves the rudder from -30 to +30 degrees in 6-8 seconds, however faster is usually better and slower is usually worse.  You can find a variety of actuators online and suggestions on the the <a href='/actuators'>actuators guide</a>.",
    "Can I mount the intertial sensor anywhere in the boat?": "For best performance, you want to minimize acceleration and compass distortions.  This means mounting closer to the center of the boat rather than the ends, however the exact location is not really critical.   What is more important is to avoid magnetic interference such as: large pieces of ferromagnetic metal, magnets, floating compasses, speaker, wires carrying current (especially transient power like solar panel wires) and anywhere that objects are placed or moved to.   You can easily experiment with this by looking at the heading reading on the pypilot display and checking to see how it changes.   The sensor themselves can be mounted in any orientation but must be leveled once fixed to the boat.",
    "Can I use existing rudder feedback sensor?": "For pypilot the rudder feedback sensor is optional, however if you have a unit with a changing voltage with rudder angle, it will work with pypilot.  This is typically potentiometer based, but could be an angular hall sensor which is the type in the pypilot <a href='/opencart'>store</a>",
    "Can I use existing wind sensors?": "yes, pypilot can receive signalk and nmea0183 directly for other types of sensors it is possible to convert them into this format.",
    "Can I use an existing TV remote control?": "Many IR (infrared remote) will work with pypilot.  You can program them with the web interface",
    "Is the pypilot hat that comes in the pypilot computer package the same as the hat which is listed separately?": "The pypilot computer includes a board which is designed specifically for the pi zero it fits on.   The pypilot hat is designed to fit any type of raspberry pi, including the zero.  The pypilot hat also includes an isolated nmea0183 port, but otherwise the functionallity is the same.",
    "Can I use any 433mhz remote control I find online?": "Many (but not all) 433mhz remote controls will work.  You can program them with the web interface",
    "Why can't I use the IBT2 motor controller to save money?": "You technically can, but it is not a good idea for most users.  The connectors are bad ones for reliability and will melt in higher current, but you could remove them and solder wires directly  The resistance is higher than even the smallest pypilot controller, so it will generate more heat.  The 43 amp 'rating' is not a continuous rating and it cannot really handle that much power.  My controllers are rated for continuous use with only 10 degree warming. Have more protection circuitry, including optical isolation and reverse polarity as well as tvs (transient voltage suppression) and use much higher quality parts, for example 63 volt capacitors that will take decades to dry out as opposed to using the smallest and lowest rated ones possible.  Finally, you would still have to integrate a microcontroller and ensure all the interconnections are reliable.",
    "What is the typical power consumption": "There is no definite answer because it depends on the boat, rudder, sea state, and conditions.  Typical values for tiller-steered boats range from 1-3 watts (average) in light conditions to 5-6 watts in larger waves.  For larger boats (50ft) with hydraulics, the power ranges from 10-15 watts up to 50-60 watts in stronger conditions.",
    "Where do I connect the clutch/bypass valve for my hydraulic drive to the pypilot motor controller?": "The mid and high power motor controllers both have a 'clutch-' terminal which becomes grounded when the clutch is engaged.   You should connect the clutch - wire to this pin and the clutch + wire to the power input (terminal right next to 'clutch-')"
}
